# Pandas 1

Pandas is a Python packages with a number of data analysis tools.
Its Series and DataFrame data structures provides way to represent data for data analysis
With Pandas, we store data in various formats include CSV, MS Excel, Text file

In [6]:
# import the Pandas library into the environment
import pandas as pd

In [7]:
# A series is a one-dimensional array.  It is possible to change the value but not the size of the series
series1 = pd.Series([10,20,30])
print(series1)  # output: first column - indexes of the elements
                #         second column - the elements

0    10
1    20
2    30
dtype: int64

In [8]:
# create a series data structure from numpy array

import numpy as np
import pandas as pd

names = np.array(['Esther','Tin','Nicholas','Michael'])
s2 = pd.Series(names)
print(s2)

0      Esther
1         Tin
2    Nicholas
3     Michael
dtype: object

In [9]:
# Dataframe resembles a table
df = pd.DataFrame ({
    "Name": ['Esther','Tin','Nicholas','Michael'],
    "Age" : [21,25, 26, 28],
    "PhoneNumber" : ['65160001', '65160002', '65160003', '65160004']
})
print(df)

       Name  Age PhoneNumber
0    Esther   21    65160001
1       Tin   25    65160002
2  Nicholas   26    65160003
3   Michael   28    65160004

In [10]:
numList =[1,2,3,4]
df = pd.DataFrame(numList)
print(df)
print(df.dtypes)

   0
0  1
1  2
2  3
3  4
0    int64
dtype: object

In [11]:
names =  [['Derek', 7000], ['Wendy', 3000], ['Nicholas', 6000], ['Michael', 8000]]
    
df = pd.DataFrame(names, columns =['Name', 'Salary'], dtype=float)    # set the datatype (Age) to float
print(df)
print(df.dtypes)
df.describe() # summary statistics of the data contained in the dataframe

       Name  Salary
0     Derek  7000.0
1     Wendy  3000.0
2  Nicholas  6000.0
3   Michael  8000.0
Name       object
Salary    float64
dtype: object

            Salary
count     4.000000
mean   6000.000000
std    2160.246899
min    3000.000000
25%    5250.000000
50%    6500.000000
75%    7250.000000
max    8000.000000

In [12]:
df #print dataframe contents

       Name  Salary
0     Derek  7000.0
1     Wendy  3000.0
2  Nicholas  6000.0
3   Michael  8000.0

In [13]:
df.to_csv('Person.csv', index=False, header=True)   # write file with header

In [14]:
df.to_csv('Person.csv', index=False, header=False)

# Read File

In [16]:
Location = "Person.csv"

In [17]:
df = pd.read_csv(Location, header=None)  # read file without header
df

          0       1
0     Derek  7000.0
1     Wendy  3000.0
2  Nicholas  6000.0
3   Michael  8000.0

In [18]:
df = pd.read_csv(Location, names= ['Names', 'Salary'])   # read file and specify column title
df

      Names  Salary
0     Derek  7000.0
1     Wendy  3000.0
2  Nicholas  6000.0
3   Michael  8000.0

In [19]:
max_value = df.Salary.max()            # get max value for the column

df["Names"] [df.Salary == max_value]

3    Michael
Name: Names, dtype: object

In [20]:
df.Names       # display column

0       Derek
1       Wendy
2    Nicholas
3     Michael
Name: Names, dtype: object

In [21]:
df["Names"]

0       Derek
1       Wendy
2    Nicholas
3     Michael
Name: Names, dtype: object

In [22]:
df.dtypes # check data types of the columns

Names      object
Salary    float64
dtype: object

In [76]:
df.Salary.dtype # check data type of a column

dtype('float64')

# Analyze Data

In [29]:
df["Salary"]

0    7000.0
1    3000.0
2    6000.0
3    8000.0
Name: Salary, dtype: float64

In [28]:
df["Salary"].mean()  # get average

6000.0

In [23]:
df['Salary'].max() #check max value

8000.0

In [24]:
Sorted = df.sort_values(['Salary'], ascending = False)
Sorted.head(2)  # top sa salaried person

     Names  Salary
3  Michael  8000.0
0    Derek  7000.0

In [28]:
df["Salary"].mean()

6000.0